# Element Id Properties

Source: https://www.revitapidocs.com/2026/6551f79a-beaf-ebd2-ea64-97d225026d31.htm

---

| Element Id Properties |
| --- |

The ElementId type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | InvalidElementId | Get the invalid ElementId whose value is \-1\. |
|  | Value | Provides the value of the element id as a 64\-bit integer. |

Top See Also

#### Reference

ElementId Class Autodesk.Revit.DB Namespace